    DCL 1 COMMAREA BASED(COMPOINT),
        2 A1CHAR1 CHAR(1),
        2 A2FB15 FIXED BIN(15),
        2 A3CHAR2 CHAR(2),
        2 A4FB15 FIXED BIN(15),
        2 A5CHAR3 CHAR(3),
        2 A6FB31 FIXED BIN(31),
        2 A7CHAR1 CHAR(1),
        2 A8FB31 FIXED BIN(31);
