     DECLARE 1 DFH0MZ7I AUTOMATIC UNALIGNED,
          2  DFHMS1 CHARACTER (12),
          2  MTRNL    FIXED BINARY (15,0),
          2  MTRNF    CHARACTER (1),
          2  DFHMS2 CHARACTER (2),
          2  MTRNI  CHARACTER (4),
          2  MMSG1L    FIXED BINARY (15,0),
          2  MMSG1F    CHARACTER (1),
          2  DFHMS3 CHARACTER (2),
          2  MMSG1I  CHARACTER (79),
          2  MCUSTNOL    FIXED BINARY (15,0),
          2  MCUSTNOF    CHARACTER (1),
          2  DFHMS4 CHARACTER (2),
          2  MCUSTNOI  CHARACTER (4),
          2  MCUSTNML    FIXED BINARY (15,0),
          2  MCUSTNMF    CHARACTER (1),
          2  DFHMS5 CHARACTER (2),
          2  MCUSTNMI  CHARACTER (28),
          2  MCUSTA1L    FIXED BINARY (15,0),
          2  MCUSTA1F    CHARACTER (1),
          2  DFHMS6 CHARACTER (2),
          2  MCUSTA1I  CHARACTER (32),
          2  MCUSTA2L    FIXED BINARY (15,0),
          2  MCUSTA2F    CHARACTER (1),
          2  DFHMS7 CHARACTER (2),
          2  MCUSTA2I  CHARACTER (32),
          2  MCUSTA3L    FIXED BINARY (15,0),
          2  MCUSTA3F    CHARACTER (1),
          2  DFHMS8 CHARACTER (2),
          2  MCUSTA3I  CHARACTER (32),
          2  MMSG2L    FIXED BINARY (15,0),
          2  MMSG2F    CHARACTER (1),
          2  DFHMS9 CHARACTER (2),
          2  MMSG2I  CHARACTER (79),
          2 FILL0084  CHARACTER (1);
